
## :white_check_mark: Apply Succeeded

[CI link](https://github.com/NaokiYazawa/aws-ecs-terraform/actions/runs/3813452762)



<pre><code>Apply complete! Resources: 2 added, 0 changed, 0 destroyed.</code></pre>

<details><summary>Details (Click me)</summary>

```hcl
Acquiring state lock. This may take a few moments...
module.vpc.aws_eip.nat[1]: Refreshing state... [id=eipalloc-089be32b53ed93a44]
aws_ecr_repository.ecr_repository: Refreshing state... [id=go-simple-server]
aws_ecs_cluster.ecs_cluster: Refreshing state... [id=arn:aws:ecs:ap-northeast-1:761817748648:cluster/go-simple-server]
module.vpc.aws_vpc.this[0]: Refreshing state... [id=vpc-0987943897935233f]
module.vpc.aws_eip.nat[0]: Refreshing state... [id=eipalloc-04569be9cc5bcc498]
aws_ecr_lifecycle_policy.ecr_lifecycle_policy: Refreshing state... [id=go-simple-server]
aws_security_group.ecs: Refreshing state... [id=sg-041f51729fc1786ce]
aws_lb_target_group.target_group: Refreshing state... [id=arn:aws:elasticloadbalancing:ap-northeast-1:761817748648:targetgroup/go-simple-server-target-group/8afa1aa532757fb2]
aws_security_group.alb: Refreshing state... [id=sg-063dfdb42dc033bce]
module.vpc.aws_subnet.private[1]: Refreshing state... [id=subnet-08f97f54831d3942d]
module.vpc.aws_route_table.private[0]: Refreshing state... [id=rtb-0c1dce4975135cf8b]
module.vpc.aws_route_table.public[0]: Refreshing state... [id=rtb-034d6d26fe71ea68f]
module.vpc.aws_internet_gateway.this[0]: Refreshing state... [id=igw-0a4fcc6d5cb800c01]
module.vpc.aws_subnet.public[0]: Refreshing state... [id=subnet-0667441fb811d1d62]
module.vpc.aws_route_table.private[1]: Refreshing state... [id=rtb-012beb5fcb619b0c2]
module.vpc.aws_subnet.private[0]: Refreshing state... [id=subnet-0a0c6669630006012]
module.vpc.aws_subnet.public[1]: Refreshing state... [id=subnet-096a25608f5b80071]
aws_security_group_rule.ecs_from_alb: Refreshing state... [id=sgrule-1703941547]
module.vpc.aws_route.public_internet_gateway[0]: Refreshing state... [id=r-rtb-034d6d26fe71ea68f1080289494]
module.vpc.aws_route_table_association.private[0]: Refreshing state... [id=rtbassoc-0ecb9a2a63a31e7e9]
module.vpc.aws_route_table_association.private[1]: Refreshing state... [id=rtbassoc-073b879e0fec67ce4]
module.vpc.aws_nat_gateway.this[1]: Refreshing state... [id=nat-091d85cb66945c032]
module.vpc.aws_route_table_association.public[1]: Refreshing state... [id=rtbassoc-0a74d238845291c01]
module.vpc.aws_route_table_association.public[0]: Refreshing state... [id=rtbassoc-0e1193eb6f82459ec]
aws_lb.alb: Refreshing state... [id=arn:aws:elasticloadbalancing:ap-northeast-1:761817748648:loadbalancer/app/go-simple-server-alb/1e1884b0df6efa30]
module.vpc.aws_nat_gateway.this[0]: Refreshing state... [id=nat-0d135d080dd37e251]
module.vpc.aws_route.private_nat_gateway[0]: Refreshing state... [id=r-rtb-0c1dce4975135cf8b1080289494]
module.vpc.aws_route.private_nat_gateway[1]: Refreshing state... [id=r-rtb-012beb5fcb619b0c21080289494]
aws_lb_listener.alb_listener: Refreshing state... [id=arn:aws:elasticloadbalancing:ap-northeast-1:761817748648:listener/app/go-simple-server-alb/1e1884b0df6efa30/c0028cfbd8873f18]
aws_lb_listener_rule.alb_listener_rule: Refreshing state... [id=arn:aws:elasticloadbalancing:ap-northeast-1:761817748648:listener-rule/app/go-simple-server-alb/1e1884b0df6efa30/c0028cfbd8873f18/5a85275c312eb69a]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_cloudwatch_log_group.cloudwatch_log_group will be created
  + resource "aws_cloudwatch_log_group" "cloudwatch_log_group" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + name              = "/aws/ecs/go-simple-server"
      + name_prefix       = (known after apply)
      + retention_in_days = 1
      + skip_destroy      = false
      + tags_all          = (known after apply)
    }

  # aws_ecs_task_definition.ecs_task_definition will be created
  + resource "aws_ecs_task_definition" "ecs_task_definition" {
      + arn                      = (known after apply)
      + container_definitions    = jsonencode(
            [
              + {
                  + essential        = true
                  + image            = "761817748648.dkr.ecr.ap-northeast-1.amazonaws.com/go-simple-server:99b26439529d13af34440227b879a3165dc492ec"
                  + logConfiguration = {
                      + logDriver = "awslogs"
                      + options   = {
                          + awslogs-group         = "/aws/ecs/go-simple-server"
                          + awslogs-region        = "ap-northeast-1"
                          + awslogs-stream-prefix = "go-simple-server"
                        }
                    }
                  + name             = "go-simple-server"
                  + portMappings     = [
                      + {
                          + containerPort = 8080
                          + hostPort      = 8080
                          + protocol      = "tcp"
                        },
                    ]
                },
            ]
        )
      + cpu                      = "256"
      + execution_role_arn       = "arn:aws:iam::761817748648:role/ecsTaskExecutionRole"
      + family                   = "go-simple-server"
      + id                       = (known after apply)
      + memory                   = "512"
      + network_mode             = "awsvpc"
      + requires_compatibilities = [
          + "FARGATE",
        ]
      + revision                 = (known after apply)
      + skip_destroy             = false
      + tags_all                 = (known after apply)
      + task_role_arn            = "arn:aws:iam::761817748648:role/ecsTaskExecutionRole"
    }

Plan: 2 to add, 0 to change, 0 to destroy.
aws_cloudwatch_log_group.cloudwatch_log_group: Creating...
aws_ecs_task_definition.ecs_task_definition: Creating...
aws_ecs_task_definition.ecs_task_definition: Creation complete after 1s [id=go-simple-server]
aws_cloudwatch_log_group.cloudwatch_log_group: Creation complete after 1s [id=/aws/ecs/go-simple-server]
Releasing state lock. This may take a few moments...

Apply complete! Resources: 2 added, 0 changed, 0 destroyed.

```

</details>

<!-- github-comment: {"Command":"apply","JobName":"terraform","PRNumber":12,"Program":"tfcmt","SHA1":"7bf037f133101086979fb0e41fc769cecfccb38f","Vars":{},"WorkflowName":"Terraform"} -->